cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--ISPR-->
        <register>
          <name>ISPR</name>
          <displayName>ISPR</displayName>
          <description>ISPR</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SETPEND0</name>
              <description>SETPEND0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND1</name>
              <description>SETPEND1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND2</name>
              <description>SETPEND2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND3</name>
              <description>SETPEND3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND4</name>
              <description>SETPEND4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND5</name>
              <description>SETPEND5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND6</name>
              <description>SETPEND6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND7</name>
              <description>SETPEND7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND8</name>
              <description>SETPEND8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND9</name>
              <description>SETPEND9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND10</name>
              <description>SETPEND10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND11</name>
              <description>SETPEND11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND12</name>
              <description>SETPEND12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND13</name>
              <description>SETPEND13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND14</name>
              <description>SETPEND14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND15</name>
              <description>SETPEND15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND16</name>
              <description>SETPEND16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND17</name>
              <description>SETPEND17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND18</name>
              <description>SETPEND18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND19</name>
              <description>SETPEND19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND20</name>
              <description>SETPEND20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND21</name>
              <description>SETPEND21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND22</name>
              <description>SETPEND22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND23</name>
              <description>SETPEND23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND24</name>
              <description>SETPEND24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND25</name>
              <description>SETPEND25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND26</name>
              <description>SETPEND26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND27</name>
              <description>SETPEND27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND28</name>
              <description>SETPEND28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND29</name>
              <description>SETPEND29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND30</name>
              <description>SETPEND30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETPEND31</name>
              <description>SETPEND31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ICPR-->
        <register>
          <name>ICPR</name>
          <displayName>ICPR</displayName>
          <description>ICPR</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLRPEND0</name>
              <description>CLRPEND0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND1</name>
              <description>CLRPEND1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND2</name>
              <description>CLRPEND2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND3</name>
              <description>CLRPEND3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND4</name>
              <description>CLRPEND4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND5</name>
              <description>CLRPEND5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND6</name>
              <description>CLRPEND6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND7</name>
              <description>CLRPEND7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND8</name>
              <description>CLRPEND8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND9</name>
              <description>CLRPEND9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND10</name>
              <description>CLRPEND10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND11</name>
              <description>CLRPEND11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND12</name>
              <description>CLRPEND12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND13</name>
              <description>CLRPEND13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND14</name>
              <description>CLRPEND14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND15</name>
              <description>CLRPEND15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND16</name>
              <description>CLRPEND16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND17</name>
              <description>CLRPEND17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND18</name>
              <description>CLRPEND18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND19</name>
              <description>CLRPEND19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND20</name>
              <description>CLRPEND20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND21</name>
              <description>CLRPEND21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND22</name>
              <description>CLRPEND22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND23</name>
              <description>CLRPEND23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND24</name>
              <description>CLRPEND24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND25</name>
              <description>CLRPEND25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND26</name>
              <description>CLRPEND26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND27</name>
              <description>CLRPEND27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND28</name>
              <description>CLRPEND28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND29</name>
              <description>CLRPEND29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND30</name>
              <description>CLRPEND30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRPEND31</name>
              <description>CLRPEND31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR0-->
        <register>
          <name>IPR0</name>
          <displayName>IPR0</displayName>
          <description>IPR0</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_0</name>
              <description>PRI_0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_1</name>
              <description>PRI_1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_2</name>
              <description>PRI_2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_3</name>
              <description>PRI_3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR1-->
        <register>
          <name>IPR1</name>
          <displayName>IPR1</displayName>
          <description>IPR1</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_4</name>
              <description>PRI_4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_5</name>
              <description>PRI_5</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_6</name>
              <description>PRI_6</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_7</name>
              <description>PRI_7</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR2-->
        <register>
          <name>IPR2</name>
          <displayName>IPR2</displayName>
          <description>IPR2</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_8</name>
              <description>PRI_8</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_9</name>
              <description>PRI_9</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_10</name>
              <description>PRI_10</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
