cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--IPR3-->
        <register>
          <name>IPR3</name>
          <displayName>IPR3</displayName>
          <description>IPR3</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_13</name>
              <description>PRI_13</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR4-->
        <register>
          <name>IPR4</name>
          <displayName>IPR4</displayName>
          <description>IPR4</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_16</name>
              <description>PRI_16</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_17</name>
              <description>PRI_17</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_18</name>
              <description>PRI_18</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_19</name>
              <description>PRI_19</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR5-->
        <register>
          <name>IPR5</name>
          <displayName>IPR5</displayName>
          <description>IPR5</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_20</name>
              <description>PRI_20</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_21</name>
              <description>PRI_21</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_22</name>
              <description>PRI_22</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_23</name>
              <description>PRI_23</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR6-->
        <register>
          <name>IPR6</name>
          <displayName>IPR6</displayName>
          <description>IPR6</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_24</name>
              <description>PRI_24</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IPR7-->
        <register>
          <name>IPR7</name>
          <displayName>IPR7</displayName>
          <description>IPR7</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SCB-->
    <peripheral>
      <name>SCB</name>
      <version>1.0</version>
      <description>SCB</description>
      <groupName>SCB</groupName>
      <baseAddress>0xE000ED00</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--CPUID-->
        <register>
          <name>CPUID</name>
          <displayName>CPUID</displayName>
          <description>CPUID</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>PARTNO</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARCHITECTURE</name>
              <description>ARCHITECTURE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>VARIANT</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ICSR-->
        <register>
          <name>ICSR</name>
          <displayName>ICSR</displayName>
          <description>ICSR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VECTACTIVE</name>
              <description>VECTACTIVE</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>RETTOBASE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>VECTPENDING</description>
              <bitRange>[21:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>ISRPENDING</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>ISRPREEMPT</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>PENDSTCLR</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>PENDSTSET</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>PENDSVCLR</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>PENDSVSET</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIPENDSET</name>
              <description>NMIPENDSET</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
