cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--VTOR-->
        <register>
          <name>VTOR</name>
          <displayName>VTOR</displayName>
          <description>VTOR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TBLOFF</name>
              <description>TBLOFF</description>
              <bitRange>[31:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AIRCR-->
        <register>
          <name>AIRCR</name>
          <displayName>AIRCR</displayName>
          <description>AIRCR</description>
          <addressOffset>0x00000D0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>VECTCLRACTIVE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>SYSRESETREQ</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>ENDIANESS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTKEY</name>
              <description>VECTKEY</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCR-->
        <register>
          <name>SCR</name>
          <displayName>SCR</displayName>
          <description>SCR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>SLEEPONEXIT</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>SLEEPDEEP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>SEVONPEND</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CCR-->
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>CCR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNALIGN_TRP</name>
              <description>UNALIGN_TRP</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STKALIGN</name>
              <description>STKALIGN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SHPR2-->
        <register>
          <name>SHP2</name>
          <displayName>SHPR2</displayName>
          <description>SHPR2</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SHPR3-->
        <register>
          <name>SHP3</name>
          <displayName>SHPR3</displayName>
          <description>SHPR3</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SHCSR-->
        <register>
          <name>SHCSR</name>
          <displayName>SHCSR</displayName>
          <description>SHCSR</description>
          <addressOffset>0x00000D24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SVCALLPENDED</name>
              <description>SVCALLPENDED</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SysTick-->
    <peripheral>
      <name>SysTick</name>
      <version>1.0</version>
      <description>SysTick</description>
      <groupName>SysTick</groupName>
      <baseAddress>0xE000E010</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--CSR-->
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>CSR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TICKINT</name>
              <description>TICKINT</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>CLKSOURCE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNTFLAG</name>
              <description>COUNTFLAG</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--RVR-->
        <register>
          <name>RVR</name>
          <displayName>RVR</displayName>
          <description>RVR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>RELOAD</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
