cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--CVR-->
        <register>
          <name>CVR</name>
          <displayName>CVR</displayName>
          <description>CVR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CURRENT</name>
              <description>CURRENT</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CALIB-->
        <register>
          <name>CALIB</name>
          <displayName>CALIB</displayName>
          <description>CALIB</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TENMS</name>
              <description>TENMS</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>SKEW</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOREF</name>
              <description>NOREF</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--Fault_Reports-->
    <peripheral>
      <name>Fault_Reports</name>
      <version>1.0</version>
      <description>Fault_Reports</description>
      <groupName>Fault_Reports</groupName>
      <baseAddress>0xE000ED30</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--DFSR-->
        <register>
          <name>DFSR</name>
          <displayName>DFSR</displayName>
          <description>DFSR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HALTED</name>
              <description>HALTED</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPT</name>
              <description>BKPT</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWTTRAP</name>
              <description>DWTTRAP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCATCH</name>
              <description>VCATCH</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTERNAL</name>
              <description>EXTERNAL</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--FMC-->
    <peripheral>
      <name>FMC</name>
      <version>1.0</version>
      <description>FMC</description>
      <groupName>FMC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FMC</name>
        <value>2</value>
      </interrupt>
      <registers>
        <!--FMC_TADR-->
        <register>
          <name>FMC_TADR</name>
          <displayName>FMC_TADR</displayName>
          <description>FMC_TADR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TADB</name>
              <description>TADB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_WRDR-->
        <register>
          <name>FMC_WRDR</name>
          <displayName>FMC_WRDR</displayName>
          <description>FMC_WRDR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRDB</name>
              <description>WRDB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_OCMR-->
        <register>
          <name>FMC_OCMR</name>
          <displayName>FMC_OCMR</displayName>
          <description>FMC_OCMR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>CMD</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_OPCR-->
        <register>
          <name>FMC_OPCR</name>
          <displayName>FMC_OPCR</displayName>
          <description>FMC_OPCR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPM</name>
              <description>OPM</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_OIER-->
        <register>
          <name>FMC_OIER</name>
          <displayName>FMC_OIER</displayName>
          <description>FMC_OIER</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ORFIEN</name>
              <description>ORFIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITADIEN</name>
              <description>ITADIEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OBEIEN</name>
              <description>OBEIEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCMIEN</name>
              <description>IOCMIEN</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OREIEN</name>
              <description>OREIEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
