cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--FMC_OISR-->
        <register>
          <name>FMC_OISR</name>
          <displayName>FMC_OISR</displayName>
          <description>FMC_OISR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ORFF</name>
              <description>ORFF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITADF</name>
              <description>ITADF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OBEF</name>
              <description>OBEF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCMF</name>
              <description>IOCMF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OREF</name>
              <description>OREF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RORFF</name>
              <description>RORFF</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPEF</name>
              <description>PPEF</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PPSR0-->
        <register>
          <name>FMC_PPSR0</name>
          <displayName>FMC_PPSR0</displayName>
          <description>FMC_PPSR0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PPSR1-->
        <register>
          <name>FMC_PPSR1</name>
          <displayName>FMC_PPSR1</displayName>
          <description>FMC_PPSR1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PPSR2-->
        <register>
          <name>FMC_PPSR2</name>
          <displayName>FMC_PPSR2</displayName>
          <description>FMC_PPSR2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PPSR3-->
        <register>
          <name>FMC_PPSR3</name>
          <displayName>FMC_PPSR3</displayName>
          <description>FMC_PPSR3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_CPSR-->
        <register>
          <name>FMC_CPSR</name>
          <displayName>FMC_CPSR</displayName>
          <description>FMC_CPSR</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPSB</name>
              <description>CPSB</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OBPSB</name>
              <description>OBPSB</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_VMCR-->
        <register>
          <name>FMC_VMCR</name>
          <displayName>FMC_VMCR</displayName>
          <description>FMC_VMCR</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VMCB</name>
              <description>VMCB</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_MDID-->
        <register>
          <name>FMC_MDID</name>
          <displayName>FMC_MDID</displayName>
          <description>FMC_MDID</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIPID</name>
              <description>CHIPID</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MFID</name>
              <description>MFID</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PNSR-->
        <register>
          <name>FMC_PNSR</name>
          <displayName>FMC_PNSR</displayName>
          <description>FMC_PNSR</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PNSB</name>
              <description>PNSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_PSSR-->
        <register>
          <name>FMC_PSSR</name>
          <displayName>FMC_PSSR</displayName>
          <description>FMC_PSSR</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSSB</name>
              <description>PSSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_CFCR-->
        <register>
          <name>FMC_CFCR</name>
          <displayName>FMC_CFCR</displayName>
          <description>FMC_CFCR</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WAIT</name>
              <description>WAIT</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFBE</name>
              <description>PFBE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDB</name>
              <description>DCDB</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CE</name>
              <description>CE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_CID0-->
        <register>
          <name>FMC_CID0</name>
          <displayName>FMC_CID0</displayName>
          <description>FMC_CID0</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CID</name>
              <description>CID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_CID1-->
        <register>
          <name>FMC_CID1</name>
          <displayName>FMC_CID1</displayName>
          <description>FMC_CID1</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CID</name>
              <description>CID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--FMC_CID2-->
        <register>
          <name>FMC_CID2</name>
          <displayName>FMC_CID2</displayName>
          <description>FMC_CID2</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CID</name>
              <description>CID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
