cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--FMC_CID3-->
        <register>
          <name>FMC_CID3</name>
          <displayName>FMC_CID3</displayName>
          <description>FMC_CID3</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CID</name>
              <description>CID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--PWRCU-->
    <peripheral>
      <name>PWRCU</name>
      <version>1.0</version>
      <description>PWRCU</description>
      <groupName>PWRCU</groupName>
      <baseAddress>0x4006A100</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LVD_BOD</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>EVWUP</name>
        <value>3</value>
      </interrupt>
      <registers>
        <!--PWRCU_BAKSR-->
        <register>
          <name>PWRCU_BAKSR</name>
          <displayName>PWRCU_BAKSR</displayName>
          <description>PWRCU_BAKSR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKPORF</name>
              <description>BAKPORF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDF</name>
              <description>PDF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPF</name>
              <description>WUPF</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKCR-->
        <register>
          <name>PWRCU_BAKCR</name>
          <displayName>PWRCU_BAKCR</displayName>
          <description>PWRCU_BAKCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKRST</name>
              <description>BAKRST</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOLCM</name>
              <description>LDOLCM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOOFF</name>
              <description>LDOOFF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMOSON</name>
              <description>DMOSON</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN</name>
              <description>WUPEN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPIEN</name>
              <description>WUPIEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>V15RDYSC</name>
              <description>V15RDYSC</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMOSSTS</name>
              <description>DMOSSTS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKTEST-->
        <register>
          <name>PWRCU_BAKTEST</name>
          <displayName>PWRCU_BAKTEST</displayName>
          <description>PWRCU_BAKTEST</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKTEST</name>
              <description>BAKTEST</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_LVDCSR-->
        <register>
          <name>PWRCU_LVDCSR</name>
          <displayName>PWRCU_LVDCSR</displayName>
          <description>PWRCU_LVDCSR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BODEN</name>
              <description>BODEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODRIS</name>
              <description>BODRIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODF</name>
              <description>BODF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDEN</name>
              <description>LVDEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS01</name>
              <description>LVDS01</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS2</name>
              <description>LVDS2</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDF</name>
              <description>LVDF</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDIWEN</name>
              <description>LVDIWEN</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDEWEN</name>
              <description>LVDEWEN</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
