cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--PWRCU_BAKREG0-->
        <register>
          <name>PWRCU_BAKREG0</name>
          <displayName>PWRCU_BAKREG0</displayName>
          <description>PWRCU_BAKREG0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG1-->
        <register>
          <name>PWRCU_BAKREG1</name>
          <displayName>PWRCU_BAKREG1</displayName>
          <description>PWRCU_BAKREG1</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG2-->
        <register>
          <name>PWRCU_BAKREG2</name>
          <displayName>PWRCU_BAKREG2</displayName>
          <description>PWRCU_BAKREG2</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG3-->
        <register>
          <name>PWRCU_BAKREG3</name>
          <displayName>PWRCU_BAKREG3</displayName>
          <description>PWRCU_BAKREG3</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG4-->
        <register>
          <name>PWRCU_BAKREG4</name>
          <displayName>PWRCU_BAKREG4</displayName>
          <description>PWRCU_BAKREG4</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG5-->
        <register>
          <name>PWRCU_BAKREG5</name>
          <displayName>PWRCU_BAKREG5</displayName>
          <description>PWRCU_BAKREG5</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG6-->
        <register>
          <name>PWRCU_BAKREG6</name>
          <displayName>PWRCU_BAKREG6</displayName>
          <description>PWRCU_BAKREG6</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG7-->
        <register>
          <name>PWRCU_BAKREG7</name>
          <displayName>PWRCU_BAKREG7</displayName>
          <description>PWRCU_BAKREG7</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG8-->
        <register>
          <name>PWRCU_BAKREG8</name>
          <displayName>PWRCU_BAKREG8</displayName>
          <description>PWRCU_BAKREG8</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG9-->
        <register>
          <name>PWRCU_BAKREG9</name>
          <displayName>PWRCU_BAKREG9</displayName>
          <description>PWRCU_BAKREG9</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--CKCU-->
    <peripheral>
      <name>CKCU</name>
      <version>1.0</version>
      <description>CKCU</description>
      <groupName>CKCU</groupName>
      <baseAddress>0x40088000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--CKCU_GCFGR-->
        <register>
          <name>CKCU_GCFGR</name>
          <displayName>CKCU_GCFGR</displayName>
          <description>CKCU_GCFGR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>PLLSRC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKREFPRE</name>
              <description>CKREFPRE</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPRE</name>
              <description>USBPRE</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMOD</name>
              <description>LPMOD</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_GCCR-->
        <register>
          <name>CKCU_GCCR</name>
          <displayName>CKCU_GCCR</displayName>
          <description>CKCU_GCCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW</name>
              <description>SW</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEGAIN</name>
              <description>HSEGAIN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLLEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEEN</name>
              <description>HSEEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIEN</name>
              <description>HSIEN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKMEN</name>
              <description>CKMEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRCEN</name>
              <description>PSRCEN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_GCSR-->
        <register>
          <name>CKCU_GCSR</name>
          <displayName>CKCU_GCSR</displayName>
          <description>CKCU_GCSR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLRDY</name>
              <description>PLLRDY</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>HSERDY</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>HSIRDY</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSERDY</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSIRDY</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
