cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--CKCU_GCIR-->
        <register>
          <name>CKCU_GCIR</name>
          <displayName>CKCU_GCIR</displayName>
          <description>CKCU_GCIR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKSF</name>
              <description>CKSF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLLRDYF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSERDYF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSIRDYF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSERDYF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDYF</name>
              <description>LSIRDYF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKSIE</name>
              <description>CKSIE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLLRDYIE</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSERDYIE</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSIRDYIE</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSERDYIE</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDYIE</name>
              <description>LSIRDYIE</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_PLLCFGR-->
        <register>
          <name>CKCU_PLLCFGR</name>
          <displayName>CKCU_PLLCFGR</displayName>
          <description>CKCU_PLLCFGR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POTD</name>
              <description>POTD</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PFBD</name>
              <description>PFBD</description>
              <bitRange>[26:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_PLLCR-->
        <register>
          <name>CKCU_PLLCR</name>
          <displayName>CKCU_PLLCR</displayName>
          <description>CKCU_PLLCR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLBPS</name>
              <description>PLLBPS</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_AHBCFGR-->
        <register>
          <name>CKCU_AHBCFGR</name>
          <displayName>CKCU_AHBCFGR</displayName>
          <description>CKCU_AHBCFGR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AHBPRE</name>
              <description>AHBPRE</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_AHBCCR-->
        <register>
          <name>CKCU_AHBCCR</name>
          <displayName>CKCU_AHBCCR</displayName>
          <description>CKCU_AHBCCR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMCEN</name>
              <description>FMCEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>SRAMEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDMAEN</name>
              <description>PDMAEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BMEN</name>
              <description>BMEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APBEN</name>
              <description>APBEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USBEN</name>
              <description>USBEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKREFEN</name>
              <description>CKREFEN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EBIEN</name>
              <description>EBIEN</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCEN</name>
              <description>CRCEN</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAEN</name>
              <description>PAEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBEN</name>
              <description>PBEN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCEN</name>
              <description>PCEN</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDEN</name>
              <description>PDEN</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_APBCFGR-->
        <register>
          <name>CKCU_APBCFGR</name>
          <displayName>CKCU_APBCFGR</displayName>
          <description>CKCU_APBCFGR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADCDIV</name>
              <description>ADCDIV</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_APBCCR0-->
        <register>
          <name>CKCU_APBCCR0</name>
          <displayName>CKCU_APBCCR0</displayName>
          <description>CKCU_APBCCR0</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C0EN</name>
              <description>I2C0EN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>I2C1EN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0EN</name>
              <description>SPI0EN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>SPI1EN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USR0EN</name>
              <description>USR0EN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USR1EN</name>
              <description>USR1EN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UR0EN</name>
              <description>UR0EN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UR1EN</name>
              <description>UR1EN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIOEN</name>
              <description>AFIOEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTIEN</name>
              <description>EXTIEN</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCI0EN</name>
              <description>SCI0EN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2SEN</name>
              <description>I2SEN</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCI1EN</name>
              <description>SCI1EN</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_APBCCR1-->
        <register>
          <name>CKCU_APBCCR1</name>
          <displayName>CKCU_APBCCR1</displayName>
          <description>CKCU_APBCCR1</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCTM0EN</name>
              <description>MCTM0EN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTEN</name>
              <description>WDTEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPREN</name>
              <description>BKPREN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTM0EN</name>
              <description>GPTM0EN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTM1EN</name>
              <description>GPTM1EN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTM0EN</name>
              <description>BFTM0EN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTM1EN</name>
              <description>BFTM1EN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPEN</name>
              <description>CMPEN</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADCEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCTM0EN</name>
              <description>SCTM0EN</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCTM1EN</name>
              <description>SCTM1EN</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_CKST-->
        <register>
          <name>CKCU_CKST</name>
          <displayName>CKCU_CKST</displayName>
          <description>CKCU_CKST</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKSWST</name>
              <description>CKSWST</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLST</name>
              <description>PLLST</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEST</name>
              <description>HSEST</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIST</name>
              <description>HSIST</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CKCU_APBPCSR0-->
        <register>
          <name>CKCU_APBPCSR0</name>
          <displayName>CKCU_APBPCSR0</displayName>
          <description>CKCU_APBPCSR0</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C0PCLK</name>
              <description>I2C0PCLK</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1PCLK</name>
              <description>I2C1PCLK</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0PCLK</name>
              <description>SPI0PCLK</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1PCLK</name>
              <description>SPI1PCLK</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTM0PCLK</name>
              <description>BFTM0PCLK</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTM1PCLK</name>
              <description>BFTM1PCLK</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCTM0PCLK</name>
              <description>MCTM0PCLK</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTM0PCLK</name>
              <description>GPTM0PCLK</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTM1PCLK</name>
              <description>GPTM1PCLK</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USR0PCLK</name>
              <description>USR0PCLK</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USR1PCLK</name>
              <description>USR1PCLK</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UR0PCLK</name>
              <description>UR0PCLK</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UR1PCLK</name>
              <description>UR1PCLK</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
