cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--GPIOD_RR-->
        <register>
          <name>GPIOD_RR</name>
          <displayName>GPIOD_RR</displayName>
          <description>GPIOD_RR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RST0</name>
              <description>RST0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST1</name>
              <description>RST1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST2</name>
              <description>RST2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST3</name>
              <description>RST3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST4</name>
              <description>RST4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST5</name>
              <description>RST5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST6</name>
              <description>RST6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST7</name>
              <description>RST7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST8</name>
              <description>RST8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST9</name>
              <description>RST9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST10</name>
              <description>RST10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST11</name>
              <description>RST11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST12</name>
              <description>RST12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST13</name>
              <description>RST13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST14</name>
              <description>RST14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RST15</name>
              <description>RST15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--AFIO-->
    <peripheral>
      <name>AFIO</name>
      <version>1.0</version>
      <description>AFIO</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40022000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--AFIO_ESSR0-->
        <register>
          <name>AFIO_ESSR0</name>
          <displayName>AFIO_ESSR0</displayName>
          <description>AFIO_ESSR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTI0PIN</name>
              <description>EXTI0PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI1PIN</name>
              <description>EXTI1PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI2PIN</name>
              <description>EXTI2PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3PIN</name>
              <description>EXTI3PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI4PIN</name>
              <description>EXTI4PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5PIN</name>
              <description>EXTI5PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI6PIN</name>
              <description>EXTI6PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI7PIN</name>
              <description>EXTI7PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_ESSR1-->
        <register>
          <name>AFIO_ESSR1</name>
          <displayName>AFIO_ESSR1</displayName>
          <description>AFIO_ESSR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTI8PIN</name>
              <description>EXTI8PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI9PIN</name>
              <description>EXTI9PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI10PIN</name>
              <description>EXTI10PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI11PIN</name>
              <description>EXTI11PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI12PIN</name>
              <description>EXTI12PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI13PIN</name>
              <description>EXTI13PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI14PIN</name>
              <description>EXTI14PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI15PIN</name>
              <description>EXTI15PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPACFGLR-->
        <register>
          <name>AFIO_GPACFGLR</name>
          <displayName>AFIO_GPACFGLR</displayName>
          <description>AFIO_GPACFGLR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG0</name>
              <description>CFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG1</name>
              <description>CFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG2</name>
              <description>CFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG3</name>
              <description>CFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG4</name>
              <description>CFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG5</name>
              <description>CFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG6</name>
              <description>CFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7</name>
              <description>CFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPACFGHR-->
        <register>
          <name>AFIO_GPACFGHR</name>
          <displayName>AFIO_GPACFGHR</displayName>
          <description>AFIO_GPACFGHR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG8</name>
              <description>CFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG9</name>
              <description>CFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG10</name>
              <description>CFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG11</name>
              <description>CFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG12</name>
              <description>CFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG13</name>
              <description>CFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG14</name>
              <description>CFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG15</name>
              <description>CFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPBCFGLR-->
        <register>
          <name>AFIO_GPBCFGLR</name>
          <displayName>AFIO_GPBCFGLR</displayName>
          <description>AFIO_GPBCFGLR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG0</name>
              <description>CFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG1</name>
              <description>CFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG2</name>
              <description>CFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG3</name>
              <description>CFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG4</name>
              <description>CFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG5</name>
              <description>CFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG6</name>
              <description>CFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7</name>
              <description>CFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPBCFGHR-->
        <register>
          <name>AFIO_GPBCFGHR</name>
          <displayName>AFIO_GPBCFGHR</displayName>
          <description>AFIO_GPBCFGHR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG8</name>
              <description>CFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG9</name>
              <description>CFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG10</name>
              <description>CFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG11</name>
              <description>CFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG12</name>
              <description>CFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG13</name>
              <description>CFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG14</name>
              <description>CFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG15</name>
              <description>CFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
