cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--AFIO_GPCCFGLR-->
        <register>
          <name>AFIO_GPCCFGLR</name>
          <displayName>AFIO_GPCCFGLR</displayName>
          <description>AFIO_GPCCFGLR</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG0</name>
              <description>CFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG1</name>
              <description>CFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG2</name>
              <description>CFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG3</name>
              <description>CFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG4</name>
              <description>CFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG5</name>
              <description>CFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG6</name>
              <description>CFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7</name>
              <description>CFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPCCFGHR-->
        <register>
          <name>AFIO_GPCCFGHR</name>
          <displayName>AFIO_GPCCFGHR</displayName>
          <description>AFIO_GPCCFGHR</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG8</name>
              <description>CFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG9</name>
              <description>CFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG10</name>
              <description>CFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG11</name>
              <description>CFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG12</name>
              <description>CFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG13</name>
              <description>CFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG14</name>
              <description>CFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG15</name>
              <description>CFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPDCFGLR-->
        <register>
          <name>AFIO_GPDCFGLR</name>
          <displayName>AFIO_GPDCFGLR</displayName>
          <description>AFIO_GPDCFGLR</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG0</name>
              <description>CFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG1</name>
              <description>CFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG2</name>
              <description>CFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG3</name>
              <description>CFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG4</name>
              <description>CFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG5</name>
              <description>CFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG6</name>
              <description>CFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG7</name>
              <description>CFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--AFIO_GPDCFGHR-->
        <register>
          <name>AFIO_GPDCFGHR</name>
          <displayName>AFIO_GPDCFGHR</displayName>
          <description>AFIO_GPDCFGHR</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFG8</name>
              <description>CFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG9</name>
              <description>CFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG10</name>
              <description>CFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG11</name>
              <description>CFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG12</name>
              <description>CFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG13</name>
              <description>CFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG14</name>
              <description>CFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG15</name>
              <description>CFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
