cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
      </registers>
    </peripheral>
    <!--EXTI-->
    <peripheral>
      <name>EXTI</name>
      <version>1.1</version>
      <description>EXTI</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40024000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EXTI0_1</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <value>6</value>
      </interrupt>
      <registers>
        <!--EXTI_CFGR0-->
        <register>
          <name>EXTI_CFGR0</name>
          <displayName>EXTI_CFGR0</displayName>
          <description>EXTI_CFGR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR1-->
        <register>
          <name>EXTI_CFGR1</name>
          <displayName>EXTI_CFGR1</displayName>
          <description>EXTI_CFGR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR2-->
        <register>
          <name>EXTI_CFGR2</name>
          <displayName>EXTI_CFGR2</displayName>
          <description>EXTI_CFGR2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR3-->
        <register>
          <name>EXTI_CFGR3</name>
          <displayName>EXTI_CFGR3</displayName>
          <description>EXTI_CFGR3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR4-->
        <register>
          <name>EXTI_CFGR4</name>
          <displayName>EXTI_CFGR4</displayName>
          <description>EXTI_CFGR4</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR5-->
        <register>
          <name>EXTI_CFGR5</name>
          <displayName>EXTI_CFGR5</displayName>
          <description>EXTI_CFGR5</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR6-->
        <register>
          <name>EXTI_CFGR6</name>
          <displayName>EXTI_CFGR6</displayName>
          <description>EXTI_CFGR6</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR7-->
        <register>
          <name>EXTI_CFGR7</name>
          <displayName>EXTI_CFGR7</displayName>
          <description>EXTI_CFGR7</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
