cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--EXTI_WAKUPCR-->
        <register>
          <name>EXTI_WAKUPCR</name>
          <displayName>EXTI_WAKUPCR</displayName>
          <description>EXTI_WAKUPCR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTI0WEN</name>
              <description>EXTI0WEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI1WEN</name>
              <description>EXTI1WEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI2WEN</name>
              <description>EXTI2WEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3WEN</name>
              <description>EXTI3WEN</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI4WEN</name>
              <description>EXTI4WEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5WEN</name>
              <description>EXTI5WEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI6WEN</name>
              <description>EXTI6WEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI7WEN</name>
              <description>EXTI7WEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI8WEN</name>
              <description>EXTI8WEN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI9WEN</name>
              <description>EXTI9WEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI10WEN</name>
              <description>EXTI10WEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI11WEN</name>
              <description>EXTI11WEN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI12WEN</name>
              <description>EXTI12WEN</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI13WEN</name>
              <description>EXTI13WEN</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI14WEN</name>
              <description>EXTI14WEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI15WEN</name>
              <description>EXTI15WEN</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVWUPIEN</name>
              <description>EVWUPIEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_WAKUPPOLR-->
        <register>
          <name>EXTI_WAKUPPOLR</name>
          <displayName>EXTI_WAKUPPOLR</displayName>
          <description>EXTI_WAKUPPOLR</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTI0WPOL</name>
              <description>EXTI0WPOL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI1WPOL</name>
              <description>EXTI1WPOL</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI2WPOL</name>
              <description>EXTI2WPOL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3WPOL</name>
              <description>EXTI3WPOL</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI4WPOL</name>
              <description>EXTI4WPOL</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5WPOL</name>
              <description>EXTI5WPOL</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI6WPOL</name>
              <description>EXTI6WPOL</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI7WPOL</name>
              <description>EXTI7WPOL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI8WPOL</name>
              <description>EXTI8WPOL</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI9WPOL</name>
              <description>EXTI9WPOL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI10WPOL</name>
              <description>EXTI10WPOL</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI11WPOL</name>
              <description>EXTI11WPOL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI12WPOL</name>
              <description>EXTI12WPOL</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI13WPOL</name>
              <description>EXTI13WPOL</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI14WPOL</name>
              <description>EXTI14WPOL</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI15WPOL</name>
              <description>EXTI15WPOL</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EXTI_WAKUPFLG-->
        <register>
          <name>EXTI_WAKUPFLG</name>
          <displayName>EXTI_WAKUPFLG</displayName>
          <description>EXTI_WAKUPFLG</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTI0WFL</name>
              <description>EXTI0WFL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI1WFL</name>
              <description>EXTI1WFL</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI2WFL</name>
              <description>EXTI2WFL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3WFL</name>
              <description>EXTI3WFL</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI4WFL</name>
              <description>EXTI4WFL</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5WFL</name>
              <description>EXTI5WFL</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI6WFL</name>
              <description>EXTI6WFL</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI7WFL</name>
              <description>EXTI7WFL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI8WFL</name>
              <description>EXTI8WFL</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI9WFL</name>
              <description>EXTI9WFL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI10WFL</name>
              <description>EXTI10WFL</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI11WFL</name>
              <description>EXTI11WFL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI12WFL</name>
              <description>EXTI12WFL</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI13WFL</name>
              <description>EXTI13WFL</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI14WFL</name>
              <description>EXTI14WFL</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI15WFL</name>
              <description>EXTI15WFL</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
