cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
      </registers>
    </peripheral>
    <!--ADC-->
    <peripheral>
      <name>ADC</name>
      <version>1.1</version>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40010000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <value>8</value>
      </interrupt>
      <registers>
        <!--ADC_CR-->
        <register>
          <name>ADC_CR</name>
          <displayName>ADC_CR</displayName>
          <description>ADC_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADMODE</name>
              <description>ADMODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCRST</name>
              <description>ADCRST</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADCEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQL</name>
              <description>ADSEQL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSUBL</name>
              <description>ADSUBL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_LST0-->
        <register>
          <name>ADC_LST0</name>
          <displayName>ADC_LST0</displayName>
          <description>ADC_LST0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADSEQ0</name>
              <description>ADSEQ0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ1</name>
              <description>ADSEQ1</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ2</name>
              <description>ADSEQ2</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ3</name>
              <description>ADSEQ3</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_LST1-->
        <register>
          <name>ADC_LST1</name>
          <displayName>ADC_LST1</displayName>
          <description>ADC_LST1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADSEQ4</name>
              <description>ADSEQ4</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ5</name>
              <description>ADSEQ5</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ6</name>
              <description>ADSEQ6</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSEQ7</name>
              <description>ADSEQ7</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_STR-->
        <register>
          <name>ADC_STR</name>
          <displayName>ADC_STR</displayName>
          <description>ADC_STR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADST</name>
              <description>ADST</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR0-->
        <register>
          <name>ADC_DR0</name>
          <displayName>ADC_DR0</displayName>
          <description>ADC_DR0</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD0</name>
              <description>ADD0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD0</name>
              <description>ADVLD0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR1-->
        <register>
          <name>ADC_DR1</name>
          <displayName>ADC_DR1</displayName>
          <description>ADC_DR1</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD1</name>
              <description>ADD1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD1</name>
              <description>ADVLD1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR2-->
        <register>
          <name>ADC_DR2</name>
          <displayName>ADC_DR2</displayName>
          <description>ADC_DR2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD2</name>
              <description>ADD2</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD2</name>
              <description>ADVLD2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
