cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--ADC_DR3-->
        <register>
          <name>ADC_DR3</name>
          <displayName>ADC_DR3</displayName>
          <description>ADC_DR3</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD3</name>
              <description>ADD3</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD3</name>
              <description>ADVLD3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR4-->
        <register>
          <name>ADC_DR4</name>
          <displayName>ADC_DR4</displayName>
          <description>ADC_DR4</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD4</name>
              <description>ADD4</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD4</name>
              <description>ADVLD4</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR5-->
        <register>
          <name>ADC_DR5</name>
          <displayName>ADC_DR5</displayName>
          <description>ADC_DR5</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD5</name>
              <description>ADD5</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD5</name>
              <description>ADVLD5</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR6-->
        <register>
          <name>ADC_DR6</name>
          <displayName>ADC_DR6</displayName>
          <description>ADC_DR6</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD6</name>
              <description>ADD6</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD6</name>
              <description>ADVLD6</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DR7-->
        <register>
          <name>ADC_DR7</name>
          <displayName>ADC_DR7</displayName>
          <description>ADC_DR7</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADD7</name>
              <description>ADD7</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVLD7</name>
              <description>ADVLD7</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_TCR-->
        <register>
          <name>ADC_TCR</name>
          <displayName>ADC_TCR</displayName>
          <description>ADC_TCR</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADSW</name>
              <description>ADSW</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEXTI</name>
              <description>ADEXTI</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TM</name>
              <description>TM</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTM</name>
              <description>BFTM</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>CMP</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_TSR-->
        <register>
          <name>ADC_TSR</name>
          <displayName>ADC_TSR</displayName>
          <description>ADC_TSR</description>
          <addressOffset>0x0000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADSC</name>
              <description>ADSC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEXTIS</name>
              <description>ADEXTIS</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMS</name>
              <description>TMS</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFTMS</name>
              <description>BFTMS</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPS</name>
              <description>CMPS</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_WCR-->
        <register>
          <name>ADC_WCR</name>
          <displayName>ADC_WCR</displayName>
          <description>ADC_WCR</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADWLE</name>
              <description>ADWLE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADWUE</name>
              <description>ADWUE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADWALL</name>
              <description>ADWALL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADWCH</name>
              <description>ADWCH</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADLCH</name>
              <description>ADLCH</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADUCH</name>
              <description>ADUCH</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_TR-->
        <register>
          <name>ADC_TR</name>
          <displayName>ADC_TR</displayName>
          <description>ADC_TR</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADLT</name>
              <description>ADLT</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADUT</name>
              <description>ADUT</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_IER-->
        <register>
          <name>ADC_IER</name>
          <displayName>ADC_IER</displayName>
          <description>ADC_IMR</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADIES</name>
              <description>ADIES</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIEG</name>
              <description>ADIEG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIEC</name>
              <description>ADIEC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIEL</name>
              <description>ADIEL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIEU</name>
              <description>ADIEU</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIEO</name>
              <description>ADIEO</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_IRAW-->
        <register>
          <name>ADC_IRAW</name>
          <displayName>ADC_IRAW</displayName>
          <description>ADC_IRAW</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADIRAWS</name>
              <description>ADIRAWS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIRAWG</name>
              <description>ADIRAWG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIRAWC</name>
              <description>ADIRAWC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIRAWL</name>
              <description>ADIRAWL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIRAWU</name>
              <description>ADIRAWU</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIRAWO</name>
              <description>ADIRAWO</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
