cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--ADC_ISR-->
        <register>
          <name>ADC_ISR</name>
          <displayName>ADC_ISR</displayName>
          <description>ADC_ISR</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADISRS</name>
              <description>ADISRS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADISRG</name>
              <description>ADISRG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADISRC</name>
              <description>ADISRC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADISRL</name>
              <description>ADISRL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADISRU</name>
              <description>ADISRU</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADISRO</name>
              <description>ADISRO</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_ICLR-->
        <register>
          <name>ADC_ICLR</name>
          <displayName>ADC_ICLR</displayName>
          <description>ADC_ICLR</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADICLRS</name>
              <description>ADICLRS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADICLRG</name>
              <description>ADICLRG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADICLRC</name>
              <description>ADICLRC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADICLRL</name>
              <description>ADICLRL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADICLRU</name>
              <description>ADICLRU</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADICLRO</name>
              <description>ADICLRO</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ADC_DMAR-->
        <register>
          <name>ADC_DMAR</name>
          <displayName>ADC_DMAR</displayName>
          <description>ADC_DMAR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDMAS</name>
              <description>ADDMAS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDMAG</name>
              <description>ADDMAG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDMAC</name>
              <description>ADDMAC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--CMP-->
    <peripheral>
      <name>CMP</name>
      <version>1.1</version>
      <description>CMP</description>
      <groupName>CMP</groupName>
      <baseAddress>0x40058000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMP0_1</name>
        <value>7</value>
      </interrupt>
      <registers>
        <!--CR0-->
        <register>
          <name>CMP_CR0</name>
          <displayName>CMP_CR0</displayName>
          <description>CMP_CR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>CMPEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSM</name>
              <description>CMPSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPHM</name>
              <description>CMPHM</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPINSEL</name>
              <description>CMPINSEL</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPPOL</name>
              <description>CMPPOL</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVREN</name>
              <description>CVREN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVROE</name>
              <description>CVROE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVRSS</name>
              <description>CVRSS</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPOSEL</name>
              <description>CMPOSEL</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPWPEN</name>
              <description>CMPWPEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSTS</name>
              <description>CMPSTS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTECT</name>
              <description>PROTECT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CVRVALR0-->
        <register>
          <name>CMP_VALR0</name>
          <displayName>CMP_VALR0</displayName>
          <description>CMP_VALR0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CVRVAL</name>
              <description>CVRVAL</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CMPIER0-->
        <register>
          <name>CMP_IER0</name>
          <displayName>CMP_IER0</displayName>
          <description>CMP_IER0</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPFIEN</name>
              <description>CMPFIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRIEN</name>
              <description>CMPRIEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CMPTFR0-->
        <register>
          <name>CMP_TFR0</name>
          <displayName>CMP_TFR0</displayName>
          <description>CMP_TFR0</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPFF</name>
              <description>CMPFF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRF</name>
              <description>CMPRF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPFDEN</name>
              <description>CMPFDEN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRDEN</name>
              <description>CMPRDEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CR1-->
        <register>
          <name>CMP_CR1</name>
          <displayName>CMP_CR1</displayName>
          <description>CMP_CR1</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>CMPEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSM</name>
              <description>CMPSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPHM</name>
              <description>CMPHM</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPINSEL</name>
              <description>CMPINSEL</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPPOL</name>
              <description>CMPPOL</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSEL</name>
              <description>SYNCSEL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVREN</name>
              <description>CVREN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVROE</name>
              <description>CVROE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVRSS</name>
              <description>CVRSS</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPOSEL</name>
              <description>CMPOSEL</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPWPEN</name>
              <description>CMPWPEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSTS</name>
              <description>CMPSTS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTECT</name>
              <description>PROTECT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CVRVALR1-->
        <register>
          <name>CMP_VALR1</name>
          <displayName>CMP_VALR1</displayName>
          <description>CMP_VALR1</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CVRVAL</name>
              <description>CVRVAL</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
