cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--CMPIER1-->
        <register>
          <name>CMP_IER1</name>
          <displayName>CMP_IER1</displayName>
          <description>CMP_IER1</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPFIEN</name>
              <description>CMPFIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRIEN</name>
              <description>CMPRIEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CMPTFR1-->
        <register>
          <name>CMP_TFR1</name>
          <displayName>CMP_TFR1</displayName>
          <description>CMP_TFR1</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPFF</name>
              <description>CMPFF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRF</name>
              <description>CMPRF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPFDEN</name>
              <description>CMPFDEN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRDEN</name>
              <description>CMPRF</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--MCTM0-->
    <peripheral>
      <name>MCTM0</name>
      <version>1.1</version>
      <description>MCTM0</description>
      <groupName>MCTM</groupName>
      <baseAddress>0x4002C000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MCTM0</name>
        <value>10</value>
      </interrupt>
      <registers>
        <!--MCTM_CNTCFR-->
        <register>
          <name>MCTM_CNTCFR</name>
          <displayName>MCTM_CNTCFR</displayName>
          <description>MCTM_CNTCFR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UEV1DIS</name>
              <description>UEV1DIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UGDIS</name>
              <description>UGDIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMSEL</name>
              <description>CMSEL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_MDCFR-->
        <register>
          <name>MCTM_MDCFR</name>
          <displayName>MCTM_MDCFR</displayName>
          <description>MCTM_MDCFR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSEL</name>
              <description>SMSEL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MMSEL</name>
              <description>MMSEL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMSET</name>
              <description>SPMSET</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_TRCFR-->
        <register>
          <name>MCTM_TRCFR</name>
          <displayName>MCTM_TRCFR</displayName>
          <description>MCTM_TRCFR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRSEL</name>
              <description>TRSEL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CTR-->
        <register>
          <name>MCTM_CTR</name>
          <displayName>MCTM_CTR</displayName>
          <description>MCTM_CTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRBE</name>
              <description>CRBE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPRE</name>
              <description>COMPRE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMUS</name>
              <description>COMUS</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHCCDS</name>
              <description>CHCCDS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH0ICFR-->
        <register>
          <name>MCTM_CH0ICFR</name>
          <displayName>MCTM_CH0ICFR</displayName>
          <description>MCTM_CH0ICFR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI0F</name>
              <description>TI0F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCS</name>
              <description>CH0CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PSC</name>
              <description>CH0PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0SRC</name>
              <description>TI0SRC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH1ICFR-->
        <register>
          <name>MCTM_CH1ICFR</name>
          <displayName>MCTM_CH1ICFR</displayName>
          <description>MCTM_CH1ICFR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI1F</name>
              <description>TI1F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCS</name>
              <description>CH1CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PSC</name>
              <description>CH1PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
