cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--MCTM_CH2ICFR-->
        <register>
          <name>MCTM_CH2ICFR</name>
          <displayName>MCTM_CH2ICFR</displayName>
          <description>MCTM_CH2ICFR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI2F</name>
              <description>TI2F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCS</name>
              <description>CH2CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2PSC</name>
              <description>CH2PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH3ICFR-->
        <register>
          <name>MCTM_CH3ICFR</name>
          <displayName>MCTM_CH3ICFR</displayName>
          <description>MCTM_CH3ICFR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI3F</name>
              <description>TI3F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCS</name>
              <description>CH3CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3PSC</name>
              <description>CH3PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH0OCFR-->
        <register>
          <name>MCTM_CH0OCFR</name>
          <displayName>MCTM_CH0OCFR</displayName>
          <description>MCTM_CH0OCFR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0OM</name>
              <description>CH0OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PRE</name>
              <description>CH0PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0IMAE</name>
              <description>CH0IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OM3</name>
              <description>CH0OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH1OCFR-->
        <register>
          <name>MCTM_CH1OCFR</name>
          <displayName>MCTM_CH1OCFR</displayName>
          <description>MCTM_CH1OCFR</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1OM</name>
              <description>CH1OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PRE</name>
              <description>CH1PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IMAE</name>
              <description>CH1IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OM3</name>
              <description>CH1OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH2OCFR-->
        <register>
          <name>MCTM_CH2OCFR</name>
          <displayName>MCTM_CH2OCFR</displayName>
          <description>MCTM_CH2OCFR</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2OM</name>
              <description>CH2OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2PRE</name>
              <description>CH2PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2IMAE</name>
              <description>CH2IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OM3</name>
              <description>CH2OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH3OCFR-->
        <register>
          <name>MCTM_CH3OCFR</name>
          <displayName>MCTM_CH3OCFR</displayName>
          <description>MCTM_CH3OCFR</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3OM</name>
              <description>CH3OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3PRE</name>
              <description>CH3PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3IMAE</name>
              <description>CH3IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OM3</name>
              <description>CH3OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CHCTR-->
        <register>
          <name>MCTM_CHCTR</name>
          <displayName>MCTM_CHCTR</displayName>
          <description>MCTM_CHCTR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0E</name>
              <description>CH0E</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0NE</name>
              <description>CH0NE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1E</name>
              <description>CH1E</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1NE</name>
              <description>CH1NE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2E</name>
              <description>CH2E</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2NE</name>
              <description>CH2NE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3E</name>
              <description>CH3E</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CHPOLR-->
        <register>
          <name>MCTM_CHPOLR</name>
          <displayName>MCTM_CHPOLR</displayName>
          <description>MCTM_CHPOLR</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0P</name>
              <description>CH0P</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0NP</name>
              <description>CH0NP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1P</name>
              <description>CH1P</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1NP</name>
              <description>CH1NP</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2P</name>
              <description>CH2P</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2NP</name>
              <description>CH2NP</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3P</name>
              <description>CH3P</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
