cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--MCTM_CHBRKCFR-->
        <register>
          <name>MCTM_CHBRKCFR</name>
          <displayName>MCTM_CHBRKCFR</displayName>
          <description>MCTM_CHBRKCFR</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0OIS</name>
              <description>CH0OIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OISN</name>
              <description>CH0OISN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OIS</name>
              <description>CH1OIS</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OISN</name>
              <description>CH1OISN</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OIS</name>
              <description>CH2OIS</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OISN</name>
              <description>CH2OISN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OIS</name>
              <description>CH3OIS</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CHBRKCTR-->
        <register>
          <name>MCTM_CHBRKCTR</name>
          <displayName>MCTM_CHBRKCTR</displayName>
          <description>MCTM_CHBRKCTR</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKE0</name>
              <description>BKE0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKP0</name>
              <description>BKP0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHMOE</name>
              <description>CHMOE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHAOE</name>
              <description>CHAOE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKF0</name>
              <description>BKF0</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKLV</name>
              <description>LOCKLV</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GFSEL0</name>
              <description>GFSEL0</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHOSSI</name>
              <description>CHOSSI</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHOSSR</name>
              <description>CHOSSR</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHDTG</name>
              <description>CHDTG</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_DICTR-->
        <register>
          <name>MCTM_DICTR</name>
          <displayName>MCTM_DICTR</displayName>
          <description>MCTM_DICTR</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCIE</name>
              <description>CH0CCIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCIE</name>
              <description>CH1CCIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCIE</name>
              <description>CH2CCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCIE</name>
              <description>CH3CCIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV1IE</name>
              <description>UEV1IE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV2IE</name>
              <description>UEV2IE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVIE</name>
              <description>TEVIE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKIE</name>
              <description>BRKIE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCDE</name>
              <description>CH0CCDE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCDE</name>
              <description>CH1CCDE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCDE</name>
              <description>CH2CCDE</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCDE</name>
              <description>CH3CCDE</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV1DE</name>
              <description>UEV1DE</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV2DE</name>
              <description>UEV2DE</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVDE</name>
              <description>TEVDE</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_EVGR-->
        <register>
          <name>MCTM_EVGR</name>
          <displayName>MCTM_EVGR</displayName>
          <description>MCTM_EVGR</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCG</name>
              <description>CH0CCG</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCG</name>
              <description>CH1CCG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCG</name>
              <description>CH2CCG</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCG</name>
              <description>CH3CCG</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV1G</name>
              <description>UEV1G</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV2G</name>
              <description>UEV2G</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVG</name>
              <description>TEVG</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRKG</name>
              <description>BRKG</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
