cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--MCTM_INTSR-->
        <register>
          <name>MCTM_INTSR</name>
          <displayName>MCTM_INTSR</displayName>
          <description>MCTM_INTSR</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCIF</name>
              <description>CH0CCIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCIF</name>
              <description>CH1CCIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCIF</name>
              <description>CH2CCIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCIF</name>
              <description>CH3CCIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OCF</name>
              <description>CH0OCF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OCF</name>
              <description>CH1OCF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OCF</name>
              <description>CH2OCF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OCF</name>
              <description>CH3OCF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV1IF</name>
              <description>UEV1IF</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEV2IF</name>
              <description>UEV2IF</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVIF</name>
              <description>TEVIF</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK0IF</name>
              <description>BRK0IF</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CNTR-->
        <register>
          <name>MCTM_CNTR</name>
          <displayName>MCTM_CNTR</displayName>
          <description>MCTM_CNTR</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTV</name>
              <description>CNTV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_PSCR-->
        <register>
          <name>MCTM_PSCR</name>
          <displayName>MCTM_PSCR</displayName>
          <description>MCTM_PSCR</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSCV</name>
              <description>PSCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CRR-->
        <register>
          <name>MCTM_CRR</name>
          <displayName>MCTM_CRR</displayName>
          <description>MCTM_CRR</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRV</name>
              <description>CRV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_REPR-->
        <register>
          <name>MCTM_REPR</name>
          <displayName>MCTM_REPR</displayName>
          <description>MCTM_REPR</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPV</name>
              <description>REPV</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH0CCR-->
        <register>
          <name>MCTM_CH0CCR</name>
          <displayName>MCTM_CH0CCR</displayName>
          <description>MCTM_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH1CCR-->
        <register>
          <name>MCTM_CH1CCR</name>
          <displayName>MCTM_CH1CCR</displayName>
          <description>MCTM_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH2CCR-->
        <register>
          <name>MCTM_CH2CCR</name>
          <displayName>MCTM_CH2CCR</displayName>
          <description>MCTM_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH3CCR-->
        <register>
          <name>MCTM_CH3CCR</name>
          <displayName>MCTM_CH3CCR</displayName>
          <description>MCTM_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH0ACR-->
        <register>
          <name>MCTM_CH0ACR</name>
          <displayName>MCTM_CH0ACR</displayName>
          <description>MCTM_CH0ACR</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0ACV</name>
              <description>CH0ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH1ACR-->
        <register>
          <name>MCTM_CH1ACR</name>
          <displayName>MCTM_CH1ACR</displayName>
          <description>MCTM_CH1ACR</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1ACV</name>
              <description>CH1ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH2ACR-->
        <register>
          <name>MCTM_CH2ACR</name>
          <displayName>MCTM_CH2ACR</displayName>
          <description>MCTM_CH2ACR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2ACV</name>
              <description>CH2ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--MCTM_CH3ACR-->
        <register>
          <name>MCTM_CH3ACR</name>
          <displayName>MCTM_CH3ACR</displayName>
          <description>MCTM_CH3ACR</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3ACV</name>
              <description>CH3ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
