cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
      </registers>
    </peripheral>
    <!--GPTM0-->
    <peripheral>
      <name>GPTM0</name>
      <version>1.1</version>
      <description>GPTM0</description>
      <groupName>GPTM</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPTM0</name>
        <value>12</value>
      </interrupt>
      <registers>
        <!--GPTM0_CNTCFR-->
        <register>
          <name>GPTM_CNTCFR</name>
          <displayName>GPTM_CNTCFR</displayName>
          <description>GPTM_CNTCFR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UEVDIS</name>
              <description>UEVDIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UGDIS</name>
              <description>UGDIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMSEL</name>
              <description>CMSEL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_MDCFR-->
        <register>
          <name>GPTM_MDCFR</name>
          <displayName>GPTM_MDCFR</displayName>
          <description>GPTM_MDCFR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSEL</name>
              <description>SMSEL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MMSEL</name>
              <description>MMSEL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMSET</name>
              <description>SPMSET</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_TRCFR-->
        <register>
          <name>GPTM_TRCFR</name>
          <displayName>GPTM_TRCFR</displayName>
          <description>GPTM_TRCFR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRSEL</name>
              <description>TRSEL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CTR-->
        <register>
          <name>GPTM_CTR</name>
          <displayName>GPTM_CTR</displayName>
          <description>GPTM_CTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRBE</name>
              <description>CRBE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHCCDS</name>
              <description>CHCCDS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH0ICFR-->
        <register>
          <name>GPTM_CH0ICFR</name>
          <displayName>GPTM_CH0ICFR</displayName>
          <description>GPTM_CH0ICFR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI0F</name>
              <description>TI0F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCS</name>
              <description>CH0CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PSC</name>
              <description>CH0PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0SRC</name>
              <description>TI0SRC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1ICFR-->
        <register>
          <name>GPTM_CH1ICFR</name>
          <displayName>GPTM_CH1ICFR</displayName>
          <description>GPTM_CH1ICFR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI1F</name>
              <description>TI1F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCS</name>
              <description>CH1CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PSC</name>
              <description>CH1PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
