cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--GPTM0_CH2ICFR-->
        <register>
          <name>GPTM_CH2ICFR</name>
          <displayName>GPTM_CH2ICFR</displayName>
          <description>GPTM_CH2ICFR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI2F</name>
              <description>TI2F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCS</name>
              <description>CH2CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2PSC</name>
              <description>CH2PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3ICFR-->
        <register>
          <name>GPTM_CH3ICFR</name>
          <displayName>GPTM_CH3ICFR</displayName>
          <description>GPTM_CH3ICFR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI3F</name>
              <description>TI3F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCS</name>
              <description>CH3CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3PSC</name>
              <description>CH3PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH0OCFR-->
        <register>
          <name>GPTM_CH0OCFR</name>
          <displayName>GPTM_CH0OCFR</displayName>
          <description>GPTM_CH0OCFR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0OM</name>
              <description>CH0OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PRE</name>
              <description>CH0PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0IMAE</name>
              <description>CH0IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OM3</name>
              <description>CH0OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1OCFR-->
        <register>
          <name>GPTM_CH1OCFR</name>
          <displayName>GPTM_CH1OCFR</displayName>
          <description>GPTM_CH1OCFR</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1OM</name>
              <description>CH1OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PRE</name>
              <description>CH1PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IMAE</name>
              <description>CH1IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OM3</name>
              <description>CH1OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2OCFR-->
        <register>
          <name>GPTM_CH2OCFR</name>
          <displayName>GPTM_CH2OCFR</displayName>
          <description>GPTM_CH2OCFR</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2OM</name>
              <description>CH2OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2PRE</name>
              <description>CH2PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2IMAE</name>
              <description>CH2IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OM3</name>
              <description>CH2OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3OCFR-->
        <register>
          <name>GPTM_CH3OCFR</name>
          <displayName>GPTM_CH3OCFR</displayName>
          <description>GPTM_CH3OCFR</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3OM</name>
              <description>CH3OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3PRE</name>
              <description>CH3PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3IMAE</name>
              <description>CH3IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OM3</name>
              <description>CH3OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CHCTR-->
        <register>
          <name>GPTM_CHCTR</name>
          <displayName>GPTM_CHCTR</displayName>
          <description>GPTM_CHCTR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0E</name>
              <description>CH0E</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1E</name>
              <description>CH1E</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2E</name>
              <description>CH2E</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3E</name>
              <description>CH3E</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CHPOLR-->
        <register>
          <name>GPTM_CHPOLR</name>
          <displayName>GPTM_CHPOLR</displayName>
          <description>GPTM_CHPOLR</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0P</name>
              <description>CH0P</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1P</name>
              <description>CH1P</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2P</name>
              <description>CH2P</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3P</name>
              <description>CH3P</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_DICTR-->
        <register>
          <name>GPTM_DICTR</name>
          <displayName>GPTM_DICTR</displayName>
          <description>GPTM_DICTR</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCIE</name>
              <description>CH0CCIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCIE</name>
              <description>CH1CCIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCIE</name>
              <description>CH2CCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCIE</name>
              <description>CH3CCIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVIE</name>
              <description>UEVIE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVIE</name>
              <description>TEVIE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCDE</name>
              <description>CH0CCDE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCDE</name>
              <description>CH1CCDE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCDE</name>
              <description>CH2CCDE</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCDE</name>
              <description>CH3CCDE</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVDE</name>
              <description>UEVDE</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVDE</name>
              <description>TEVDE</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
