cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--GPTM0_CH1CCR-->
        <register>
          <name>GPTM_CH1CCR</name>
          <displayName>GPTM_CH1CCR</displayName>
          <description>GPTM_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2CCR-->
        <register>
          <name>GPTM_CH2CCR</name>
          <displayName>GPTM_CH2CCR</displayName>
          <description>GPTM_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3CCR-->
        <register>
          <name>GPTM_CH3CCR</name>
          <displayName>GPTM_CH3CCR</displayName>
          <description>GPTM_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH0ACR-->
        <register>
          <name>GPTM_CH0ACR</name>
          <displayName>GPTM_CH0ACR</displayName>
          <description>GPTM_CH0ACR</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0ACV</name>
              <description>CH0ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1ACR-->
        <register>
          <name>GPTM_CH1ACR</name>
          <displayName>GPTM_CH1ACR</displayName>
          <description>GPTM_CH1ACR</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1ACV</name>
              <description>CH1ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2ACR-->
        <register>
          <name>GPTM_CH2ACR</name>
          <displayName>GPTM_CH2ACR</displayName>
          <description>GPTM_CH2ACR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH2ACV</name>
              <description>CH2ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3ACR-->
        <register>
          <name>GPTM_CH3ACR</name>
          <displayName>GPTM_CH3ACR</displayName>
          <description>GPTM_CH3ACR</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH3ACV</name>
              <description>CH3ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GPTM1-->
    <peripheral derivedFrom="GPTM0">
      <name>GPTM1</name>
      <description>GPTM1</description>
      <baseAddress>0x4006F000</baseAddress>
      <interrupt>
        <name>GPTM1</name>
        <value>11</value>
      </interrupt>
    </peripheral>
    <!--SCTM0-->
    <peripheral>
      <name>SCTM0</name>
      <version>1.0</version>
      <description>SCTM0</description>
      <groupName>SCTM</groupName>
      <baseAddress>0x40034000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SCTM0</name>
        <value>13</value>
      </interrupt>
      <registers>
        <!--SCTM0_CNTCFR-->
        <register>
          <name>SCTM_CNTCFR</name>
          <displayName>SCTM_CNTCFR</displayName>
          <description>SCTM_CNTCFR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UEVDIS</name>
              <description>UEVDIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UGDIS</name>
              <description>UGDIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMSEL</name>
              <description>CMSEL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
