cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--SCTM0_MDCFR-->
        <register>
          <name>GPTM_MDCFR</name>
          <displayName>GPTM_MDCFR</displayName>
          <description>GPTM_MDCFR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSEL</name>
              <description>SMSEL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MMSEL</name>
              <description>MMSEL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMSET</name>
              <description>SPMSET</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_TRCFR-->
        <register>
          <name>GPTM_TRCFR</name>
          <displayName>GPTM_TRCFR</displayName>
          <description>GPTM_TRCFR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRSEL</name>
              <description>TRSEL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CTR-->
        <register>
          <name>GPTM_CTR</name>
          <displayName>GPTM_CTR</displayName>
          <description>GPTM_CTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRBE</name>
              <description>CRBE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHCCDS</name>
              <description>CHCCDS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CHICFR-->
        <register>
          <name>GPTM_CH0ICFR</name>
          <displayName>GPTM_CH0ICFR</displayName>
          <description>GPTM_CH0ICFR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TI0F</name>
              <description>TI0F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCS</name>
              <description>CH0CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PSC</name>
              <description>CH0PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TI0SRC</name>
              <description>TI0SRC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CHOCFR-->
        <register>
          <name>GPTM_CH1OCFR</name>
          <displayName>GPTM_CH1OCFR</displayName>
          <description>GPTM_CH1OCFR</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH1OM</name>
              <description>CH1OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PRE</name>
              <description>CH1PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IMAE</name>
              <description>CH1IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OM3</name>
              <description>CH1OM3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CHCTR-->
        <register>
          <name>GPTM_CHCTR</name>
          <displayName>GPTM_CHCTR</displayName>
          <description>GPTM_CHCTR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0E</name>
              <description>CH0E</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1E</name>
              <description>CH1E</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2E</name>
              <description>CH2E</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3E</name>
              <description>CH3E</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
