cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--SCTM0_CHPOLR-->
        <register>
          <name>GPTM_CHPOLR</name>
          <displayName>GPTM_CHPOLR</displayName>
          <description>GPTM_CHPOLR</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0P</name>
              <description>CH0P</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1P</name>
              <description>CH1P</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2P</name>
              <description>CH2P</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3P</name>
              <description>CH3P</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_DICTR-->
        <register>
          <name>GPTM_DICTR</name>
          <displayName>GPTM_DICTR</displayName>
          <description>GPTM_DICTR</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCIE</name>
              <description>CH0CCIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCIE</name>
              <description>CH1CCIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCIE</name>
              <description>CH2CCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCIE</name>
              <description>CH3CCIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVIE</name>
              <description>UEVIE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVIE</name>
              <description>TEVIE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0CCDE</name>
              <description>CH0CCDE</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCDE</name>
              <description>CH1CCDE</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCDE</name>
              <description>CH2CCDE</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCDE</name>
              <description>CH3CCDE</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVDE</name>
              <description>UEVDE</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVDE</name>
              <description>TEVDE</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_EVGR-->
        <register>
          <name>GPTM_EVGR</name>
          <displayName>GPTM_EVGR</displayName>
          <description>GPTM_EVGR</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCG</name>
              <description>CH0CCG</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCG</name>
              <description>CH1CCG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCG</name>
              <description>CH2CCG</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCG</name>
              <description>CH3CCG</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVG</name>
              <description>UEVG</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVG</name>
              <description>TEVG</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_INTSR-->
        <register>
          <name>GPTM_INTSR</name>
          <displayName>GPTM_INTSR</displayName>
          <description>GPTM_INTSR</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCIF</name>
              <description>CH0CCIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CCIF</name>
              <description>CH1CCIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2CCIF</name>
              <description>CH2CCIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3CCIF</name>
              <description>CH3CCIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OCF</name>
              <description>CH0OCF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OCF</name>
              <description>CH1OCF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2OCF</name>
              <description>CH2OCF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3OCF</name>
              <description>CH3OCF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UEVIF</name>
              <description>UEVIF</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEVIF</name>
              <description>TEVIF</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CNTR-->
        <register>
          <name>GPTM_CNTR</name>
          <displayName>GPTM_CNTR</displayName>
          <description>GPTM_CNTR</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTV</name>
              <description>CNTV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_PSCR-->
        <register>
          <name>GPTM_PSCR</name>
          <displayName>GPTM_PSCR</displayName>
          <description>GPTM_PSCR</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSCV</name>
              <description>PSCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
