cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--SCTM0_CRR-->
        <register>
          <name>GPTM_CRR</name>
          <displayName>GPTM_CRR</displayName>
          <description>GPTM_CRR</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRV</name>
              <description>CRV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCTM0_CHCCR-->
        <register>
          <name>GPTM_CH0CCR</name>
          <displayName>GPTM_CH0CCR</displayName>
          <description>GPTM_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SCTM1-->
    <peripheral derivedFrom="SCTM0">
      <name>SCTM1</name>
      <description>SCTM1</description>
      <baseAddress>0x40074000</baseAddress>
      <interrupt>
        <name>SCTM1</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <!--BFTM0-->
    <peripheral>
      <name>BFTM0</name>
      <version>1.1</version>
      <description>BFTM0</description>
      <groupName>BFTM</groupName>
      <baseAddress>0x40076000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BFTM0</name>
        <value>17</value>
      </interrupt>
      <registers>
        <!--BFTM0_CR-->
        <register>
          <name>BFTM_CR</name>
          <displayName>BFTM_CR</displayName>
          <description>BFTM_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MIEN</name>
              <description>MIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSM</name>
              <description>OSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>CEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--BFTM0_SR-->
        <register>
          <name>BFTM_SR</name>
          <displayName>BFTM_SR</displayName>
          <description>BFTM_SR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MIF</name>
              <description>MIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--BFTM0_CNTR-->
        <register>
          <name>BFTM_CNTR</name>
          <displayName>BFTM_CNTR</displayName>
          <description>BFTM_CNTR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTR</name>
              <description>CNTR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--BFTM0_CMPR-->
        <register>
          <name>BFTM_CMPR</name>
          <displayName>BFTM_CMPR</displayName>
          <description>BFTM_CMPR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--BFTM1-->
    <peripheral derivedFrom="BFTM0">
      <name>BFTM1</name>
      <description>BFTM1</description>
      <baseAddress>0x40077000</baseAddress>
      <interrupt>
        <name>BFTM1</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <!--RTC-->
    <peripheral>
      <name>RTC</name>
      <version>1.1</version>
      <description>RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4006A000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <value>1</value>
      </interrupt>
      <registers>
        <!--RTC_CNT-->
        <register>
          <name>RTC_CNT</name>
          <displayName>RTC_CNT</displayName>
          <description>RTC_CNT</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RTCCNT</name>
              <description>RTCCNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
