cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--I2C0_SHPGR-->
        <register>
          <name>I2C_SHPGR</name>
          <displayName>I2C_SHPGR</displayName>
          <description>I2C_SHPGR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SHPG</name>
              <description>SHPG</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_SLPGR-->
        <register>
          <name>I2C_SLPGR</name>
          <displayName>I2C_SLPGR</displayName>
          <description>I2C_SLPGR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLPG</name>
              <description>SLPG</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_DR-->
        <register>
          <name>I2C_DR</name>
          <displayName>I2C_DR</displayName>
          <description>I2C_DR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_TAR-->
        <register>
          <name>I2C_TAR</name>
          <displayName>I2C_TAR</displayName>
          <description>I2C_TAR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TAR</name>
              <description>TAR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWD</name>
              <description>RWD</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_ADDMR-->
        <register>
          <name>I2C_ADDMR</name>
          <displayName>I2C_ADDMR</displayName>
          <description>I2C_ADDMR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDMR</name>
              <description>ADDMR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_ADDSR-->
        <register>
          <name>I2C_ADDSR</name>
          <displayName>I2C_ADDSR</displayName>
          <description>I2C_ADDSR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDSR</name>
              <description>ADDSR</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2C0_TOUT-->
        <register>
          <name>I2C_TOUT</name>
          <displayName>I2C_TOUT</displayName>
          <description>I2C_TOUT</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOUT</name>
              <description>TOUT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSC</name>
              <description>PSC</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--I2C1-->
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <description>I2C1</description>
      <baseAddress>0x40049000</baseAddress>
      <interrupt>
        <name>I2C1</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!--SPI0-->
    <peripheral>
      <name>SPI0</name>
      <version>1.1</version>
      <description>SPI0</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI0</name>
        <value>21</value>
      </interrupt>
      <registers>
        <!--SPI0_CR0-->
        <register>
          <name>SPI_CR0</name>
          <displayName>SPI_CR0</displayName>
          <description>SPI_CR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPIEN</name>
              <description>SPIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>TXDMAE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>RXDMAE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELOEN</name>
              <description>SELOEN</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SSELC</name>
              <description>SSELC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUALEN</name>
              <description>DUALEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUADTEN</name>
              <description>GUADTEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUADT</name>
              <description>GUADT</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELHT</name>
              <description>SELHT</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SPI0_CR1-->
        <register>
          <name>SPI_CR1</name>
          <displayName>SPI_CR1</displayName>
          <description>SPI_CR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFL</name>
              <description>DFL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>FORMAT</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELAP</name>
              <description>SELAP</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIRSTBIT</name>
              <description>FIRSTBIT</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELM</name>
              <description>SELM</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
