cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--SPI0_FTOCR-->
        <register>
          <name>SPI_FTOCR</name>
          <displayName>SPI_FTOCR</displayName>
          <description>SPI_FTOCR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOC</name>
              <description>TOC</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SPI1-->
    <peripheral derivedFrom="SPI0">
      <name>SPI1</name>
      <description>SPI1</description>
      <baseAddress>0x40044000</baseAddress>
      <interrupt>
        <name>SPI1</name>
        <value>22</value>
      </interrupt>
    </peripheral>
    <!--USART0-->
    <peripheral>
      <name>USART0</name>
      <version>1.1</version>
      <description>USART0</description>
      <groupName>USART</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART0</name>
        <value>23</value>
      </interrupt>
      <registers>
        <!--USART0_DR-->
        <register>
          <name>USART_USRDR</name>
          <displayName>USART_USRDR</displayName>
          <description>USART_USRDR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DB</name>
              <description>DB</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_CR-->
        <register>
          <name>USART_USRCR</name>
          <displayName>USART_USRCR</displayName>
          <description>USART_USRCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRSM</name>
              <description>TRSM</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HFCEN</name>
              <description>HFCEN</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URTXEN</name>
              <description>URTXEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URRXEN</name>
              <description>URRXEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TXDMAEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RXDMAEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLS</name>
              <description>WLS</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSB</name>
              <description>NSB</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBE</name>
              <description>PBE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPE</name>
              <description>EPE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPE</name>
              <description>SPE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCB</name>
              <description>BCB</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTS</name>
              <description>RTS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_FCR-->
        <register>
          <name>USART_USRFCR</name>
          <displayName>USART_USRFCR</displayName>
          <description>USART_USRFCR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXR</name>
              <description>TXR</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXR</name>
              <description>RXR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXTL</name>
              <description>TXTL</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTL</name>
              <description>RXTL</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFS</name>
              <description>TXFS</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFS</name>
              <description>RXFS</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
