cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--USART0_IER-->
        <register>
          <name>USART_USRIER</name>
          <displayName>USART_USRIER</displayName>
          <description>USART_USRIER</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDRIE</name>
              <description>RXDRIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDEIE</name>
              <description>TXDEIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCIE</name>
              <description>TXCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OEIE</name>
              <description>OEIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEIE</name>
              <description>PEIE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEIE</name>
              <description>FEIE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIE</name>
              <description>BIE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSADDIE</name>
              <description>RSADDIE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTOIE</name>
              <description>RXTOIE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSIE</name>
              <description>CTSIE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_IFR-->
        <register>
          <name>USART_USRSIFR</name>
          <displayName>USART_USRSIFR</displayName>
          <description>USART_USRSIFR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDNE</name>
              <description>RXDNE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OEI</name>
              <description>OEI</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEI</name>
              <description>PEI</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEI</name>
              <description>FEI</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BII</name>
              <description>BII</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDR</name>
              <description>RXDR</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTOF</name>
              <description>RXTOF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDE</name>
              <description>TXDE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXC</name>
              <description>TXC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSADDE</name>
              <description>RSADDE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSC</name>
              <description>CTSC</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSS</name>
              <description>CTSS</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_TPR-->
        <register>
          <name>USART_USRTPR</name>
          <displayName>USART_USRTPR</displayName>
          <description>USART_USRTPR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXTOC</name>
              <description>RXTOC</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTOEN</name>
              <description>RXTOEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TG</name>
              <description>TG</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
