cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--USART0_IrDACR-->
        <register>
          <name>USART_IrDACR</name>
          <displayName>USART_IrDACR</displayName>
          <description>USART_IrDACR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IrDAEN</name>
              <description>IrDAEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IrDALP</name>
              <description>IrDALP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSEL</name>
              <description>TXSEL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LB</name>
              <description>LB</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINV</name>
              <description>TXINV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINV</name>
              <description>RXINV</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IrDAPSC</name>
              <description>IrDAPSC</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_RS485CR-->
        <register>
          <name>USART_RS485CR</name>
          <displayName>USART_RS485CR</displayName>
          <description>USART_RS485CR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXENP</name>
              <description>TXENP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSNMM</name>
              <description>RSNMM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSAAD</name>
              <description>RSAAD</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDMATCH</name>
              <description>ADDMATCH</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_SYNCR-->
        <register>
          <name>USART_SYNCR</name>
          <displayName>USART_SYNCR</displayName>
          <description>USART_SYNCR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>CLKEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPS</name>
              <description>CPS</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPO</name>
              <description>CPO</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_USRDLR-->
        <register>
          <name>USART_USRDLR</name>
          <displayName>USART_USRDLR</displayName>
          <description>USART_USRDLR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRD</name>
              <description>BRD</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USART0_USRTSTR-->
        <register>
          <name>USART_USRTSTR</name>
          <displayName>USART_USRTSTR</displayName>
          <description>USART_USRTSTR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LBM</name>
              <description>LBM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--USART1-->
    <peripheral derivedFrom="USART0">
      <name>USART1</name>
      <description>USART1</description>
      <baseAddress>0x40040000</baseAddress>
      <interrupt>
        <name>USART1</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <!--UART0-->
    <peripheral>
      <name>UART0</name>
      <version>1.1</version>
      <description>UART0</description>
      <groupName>UART</groupName>
      <baseAddress>0x40001000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>25</value>
      </interrupt>
      <registers>
        <!--UART0_URDR-->
        <register>
          <name>UART_URDR</name>
          <displayName>UART_URDR</displayName>
          <description>UART_URDR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DB</name>
              <description>DB</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--UART0_URCR-->
        <register>
          <name>UART_URCR</name>
          <displayName>UART_URCR</displayName>
          <description>UART_URCR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRSM</name>
              <description>TRSM</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URTXEN</name>
              <description>URTXEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URRXEN</name>
              <description>URRXEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TXDMAEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RXDMAEN</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLS</name>
              <description>WLS</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSB</name>
              <description>NSB</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PBE</name>
              <description>PBE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPE</name>
              <description>EPE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPE</name>
              <description>SPE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCB</name>
              <description>BCB</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--UART0_URIER-->
        <register>
          <name>UART_URIER</name>
          <displayName>UART_URIER</displayName>
          <description>UART_URIER</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDRIE</name>
              <description>RXDRIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDEIE</name>
              <description>TXDEIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCIE</name>
              <description>TXCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OEIE</name>
              <description>OEIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEIE</name>
              <description>PEIE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEIE</name>
              <description>FEIE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIE</name>
              <description>BIE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--UART0_URSIFR-->
        <register>
          <name>UART_URSIFR</name>
          <displayName>UART_URSIFR</displayName>
          <description>UART_URSIFR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OEI</name>
              <description>OEI</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEI</name>
              <description>PEI</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEI</name>
              <description>FEI</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BII</name>
              <description>BII</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDR</name>
              <description>RXDR</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDE</name>
              <description>TXDE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXC</name>
              <description>TXC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
