cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--UART0_URDLR-->
        <register>
          <name>UART_URDLR</name>
          <displayName>UART_URDLR</displayName>
          <description>UART_URDLR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRD</name>
              <description>BRD</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--UART0_URTSTR-->
        <register>
          <name>UART_URTSTR</name>
          <displayName>UART_URTSTR</displayName>
          <description>UART_URTSTR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LBM</name>
              <description>LBM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--UART1-->
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <description>UART1</description>
      <baseAddress>0x40041000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <value>26</value>
      </interrupt>
    </peripheral>
    <!--SCI-->
    <peripheral>
      <name>SCI</name>
      <version>1.1</version>
      <description>SCI</description>
      <groupName>SCI</groupName>
      <baseAddress>0x40043000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SCI</name>
        <value>27</value>
      </interrupt>
      <registers>
        <!--SCI_CR-->
        <register>
          <name>SCI_CR</name>
          <displayName>SCI_CR</displayName>
          <description>SCI_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONV</name>
              <description>CONV</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CREP</name>
              <description>CREP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WTEN</name>
              <description>WTEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCIM</name>
              <description>SCIM</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRY</name>
              <description>RETRY</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSCI</name>
              <description>ENSCI</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DETCNF</name>
              <description>DETCNF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMA</name>
              <description>TXDMA</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMA</name>
              <description>RXDMA</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_SR-->
        <register>
          <name>SCI_SR</name>
          <displayName>SCI_SR</displayName>
          <description>SCI_SR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARF</name>
              <description>PARF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCF</name>
              <description>RXCF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCF</name>
              <description>TXCF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WTF</name>
              <description>WTF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPREF</name>
              <description>CPREF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBEF</name>
              <description>TXBEF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_CCR-->
        <register>
          <name>SCI_CCR</name>
          <displayName>SCI_CCR</displayName>
          <description>SCI_CCR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCLK</name>
              <description>CCLK</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CDIO</name>
              <description>CDIO</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>CLKSEL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_ETUR-->
        <register>
          <name>SCI_ETUR</name>
          <displayName>SCI_ETUR</displayName>
          <description>SCI_ETUR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ETU</name>
              <description>ETU</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
