cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--SCI_GTR-->
        <register>
          <name>SCI_GTR</name>
          <displayName>SCI_GTR</displayName>
          <description>SCI_GTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GT</name>
              <description>GT</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_WTR-->
        <register>
          <name>SCI_WTR</name>
          <displayName>SCI_WTR</displayName>
          <description>SCI_WTR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WT</name>
              <description>WT</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_IER-->
        <register>
          <name>SCI_IER</name>
          <displayName>SCI_IER</displayName>
          <description>SCI_IER</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARE</name>
              <description>PARE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCE</name>
              <description>RXCE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCE</name>
              <description>TXCE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WTE</name>
              <description>WTE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CARDIRE</name>
              <description>CARDIRE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBEE</name>
              <description>TXBEE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_IPR-->
        <register>
          <name>SCI_IPR</name>
          <displayName>SCI_IPR</displayName>
          <description>SCI_IPR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PARP</name>
              <description>PARP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCP</name>
              <description>RXCP</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCP</name>
              <description>TXCP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WTP</name>
              <description>WTP</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CARDIRP</name>
              <description>CARDIRP</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBEP</name>
              <description>TXBEP</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_TXB-->
        <register>
          <name>SCI_TXB</name>
          <displayName>SCI_TXB</displayName>
          <description>SCI_TXB</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TB</name>
              <description>TB</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_RXB-->
        <register>
          <name>SCI_RXB</name>
          <displayName>SCI_RXB</displayName>
          <description>SCI_RXB</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RB</name>
              <description>RB</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--SCI_PSCR-->
        <register>
          <name>SCI_PSCR</name>
          <displayName>SCI_PSCR</displayName>
          <description>SCI_PSCR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSC</name>
              <description>PSC</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--USB-->
    <peripheral>
      <name>USB</name>
      <version>1.1</version>
      <description>USB</description>
      <groupName>USB</groupName>
      <baseAddress>0x400A8000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB</name>
        <value>29</value>
      </interrupt>
      <registers>
        <!--USB_CSR-->
        <register>
          <name>USB_CSR</name>
          <displayName>USB_CSR</displayName>
          <description>USB_CSR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRES</name>
              <description>FRES</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDWN</name>
              <description>PDWN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMODE</name>
              <description>LPMODE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GENRSM</name>
              <description>GENRSM</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDP</name>
              <description>RXDP</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDM</name>
              <description>RXDM</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADRSET</name>
              <description>ADRSET</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMRSTC</name>
              <description>SRAMRSTC</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPPUEN</name>
              <description>DPPUEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPWKEN</name>
              <description>DPWKEN</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_IER-->
        <register>
          <name>USB_IER</name>
          <displayName>USB_IER</displayName>
          <description>USB_IER</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UGIE</name>
              <description>UGIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFIE</name>
              <description>SOFIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URSTIE</name>
              <description>URSTIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSMIE</name>
              <description>RSMIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPIE</name>
              <description>SUSPIE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESOFIE</name>
              <description>ESOFIE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0IE</name>
              <description>EP0IE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP1IE</name>
              <description>EP1IE</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP2IE</name>
              <description>EP2IE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP3IE</name>
              <description>EP3IE</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP4IE</name>
              <description>EP4IE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP5IE</name>
              <description>EP5IE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP6IE</name>
              <description>EP6IE</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP7IE</name>
              <description>EP7IE</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
