cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--USB_EP2TCR-->
        <register>
          <name>USB_EP2TCR</name>
          <displayName>USB_EP2TCR</displayName>
          <description>USB_EP2TCR</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCNT</name>
              <description>TCNT</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP2CFGR-->
        <register>
          <name>USB_EP2CFGR</name>
          <displayName>USB_EP2CFGR</displayName>
          <description>USB_EP2CFGR</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPBUFA</name>
              <description>EPBUFA</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPLEN</name>
              <description>EPLEN</description>
              <bitRange>[16:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPADR</name>
              <description>EPADR</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIR</name>
              <description>EPDIR</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>EPTYPE</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPEN</name>
              <description>EPEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP3CSR-->
        <register>
          <name>USB_EP3CSR</name>
          <displayName>USB_EP3CSR</displayName>
          <description>USB_EP3CSR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTGTX</name>
              <description>DTGTX</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKTX</name>
              <description>NAKTX</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STLTX</name>
              <description>STLTX</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTGRX</name>
              <description>DTGRX</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKRX</name>
              <description>NAKRX</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STLRX</name>
              <description>STLRX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP3IER-->
        <register>
          <name>USB_EP3IER</name>
          <displayName>USB_EP3IER</displayName>
          <description>USB_EP3IER</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OTRXIE</name>
              <description>OTRXIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODRXIE</name>
              <description>ODRXIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODOVIE</name>
              <description>ODOVIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRXIE</name>
              <description>ITRXIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTXIE</name>
              <description>IDTXIE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKIE</name>
              <description>NAKIE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STLIE</name>
              <description>STLIE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UERIE</name>
              <description>UERIE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP3ISR-->
        <register>
          <name>USB_EP3ISR</name>
          <displayName>USB_EP3ISR</displayName>
          <description>USB_EP3ISR</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OTRXIF</name>
              <description>OTRXIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODRXIF</name>
              <description>ODRXIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODOVIF</name>
              <description>ODOVIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRXIF</name>
              <description>ITRXIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTXIF</name>
              <description>IDTXIF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKIF</name>
              <description>NAKIF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STLIF</name>
              <description>STLIF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UERIF</name>
              <description>UERIF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
