cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--USB_EP7ISR-->
        <register>
          <name>USB_EP7ISR</name>
          <displayName>USB_EP7ISR</displayName>
          <description>USB_EP7ISR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OTRXIF</name>
              <description>OTRXIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODRXIF</name>
              <description>ODRXIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ODOVIF</name>
              <description>ODOVIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITRXIF</name>
              <description>ITRXIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTXIF</name>
              <description>IDTXIF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKIF</name>
              <description>NAKIF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STLIF</name>
              <description>STLIF</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UERIF</name>
              <description>UERIF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP7TCR-->
        <register>
          <name>USB_EP7TCR</name>
          <displayName>USB_EP7TCR</displayName>
          <description>USB_EP7TCR</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCNT0</name>
              <description>TCNT0</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCNT1</name>
              <description>TCNT1</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--USB_EP7CFGR-->
        <register>
          <name>USB_EP7CFGR</name>
          <displayName>USB_EP7CFGR</displayName>
          <description>USB_EP7CFGR</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EPBUFA</name>
              <description>EPBUFA</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPLEN</name>
              <description>EPLEN</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDBS</name>
              <description>SDBS</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPADR</name>
              <description>EPADR</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIR</name>
              <description>EPDIR</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>EPTYPE</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPEN</name>
              <description>EPEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--PDMA-->
    <peripheral>
      <name>PDMA</name>
      <version>1.1</version>
      <description>PDMA</description>
      <groupName>PDMA</groupName>
      <baseAddress>0x40090000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDMACH0_1</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>PDMACH2_5</name>
        <value>31</value>
      </interrupt>
      <registers>
        <!--PDMA_CH0CR-->
        <register>
          <name>PDMA_CH0CR</name>
          <displayName>PDMA_CH0CR</displayName>
          <description>PDMA_CH0CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWIDTH</name>
              <description>DWIDTH</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTAINC</name>
              <description>DSTAINC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTAMOD</name>
              <description>DSTAMOD</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCAINC</name>
              <description>SRCAINC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCAMOD</name>
              <description>SRCAMOD</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPRI</name>
              <description>CHPRI</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXAEN</name>
              <description>FIXAEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORL</name>
              <description>AUTORL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH0SADR-->
        <register>
          <name>PDMA_CH0SADR</name>
          <displayName>PDMA_CH0SADR</displayName>
          <description>PDMA_CH0SADR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SADR</name>
              <description>SADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH0DADR-->
        <register>
          <name>PDMA_CH0DADR</name>
          <displayName>PDMA_CH0DADR</displayName>
          <description>PDMA_CH0DADR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DADR</name>
              <description>DADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
