cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--PDMA_CH4SADR-->
        <register>
          <name>PDMA_CH4SADR</name>
          <displayName>PDMA_CH4SADR</displayName>
          <description>PDMA_CH4SADR</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SADR</name>
              <description>SADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH4DADR-->
        <register>
          <name>PDMA_CH4DADR</name>
          <displayName>PDMA_CH4DADR</displayName>
          <description>PDMA_CH4DADR</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DADR</name>
              <description>DADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH4TSR-->
        <register>
          <name>PDMA_CH4TSR</name>
          <displayName>PDMA_CH4TSR</displayName>
          <description>PDMA_CH4TSR</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLKLEN</name>
              <description>BLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKCNT</name>
              <description>BLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH4CTSR-->
        <register>
          <name>PDMA_CH4CTSR</name>
          <displayName>PDMA_CH4CTSR</displayName>
          <description>PDMA_CH4CTSR</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBLKLEN</name>
              <description>CBLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBLKCNT</name>
              <description>CBLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH5CR-->
        <register>
          <name>PDMA_CH5CR</name>
          <displayName>PDMA_CH5CR</displayName>
          <description>PDMA_CH5CR</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWIDTH</name>
              <description>DWIDTH</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTAINC</name>
              <description>DSTAINC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTAMOD</name>
              <description>DSTAMOD</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCAINC</name>
              <description>SRCAINC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCAMOD</name>
              <description>SRCAMOD</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPRI</name>
              <description>CHPRI</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXAEN</name>
              <description>FIXAEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORL</name>
              <description>AUTORL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH5SADR-->
        <register>
          <name>PDMA_CH5SADR</name>
          <displayName>PDMA_CH5SADR</displayName>
          <description>PDMA_CH5SADR</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SADR</name>
              <description>SADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH5DADR-->
        <register>
          <name>PDMA_CH5DADR</name>
          <displayName>PDMA_CH5DADR</displayName>
          <description>PDMA_CH5DADR</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DADR</name>
              <description>DADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH5TSR-->
        <register>
          <name>PDMA_CH5TSR</name>
          <displayName>PDMA_CH5TSR</displayName>
          <description>PDMA_CH5TSR</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLKLEN</name>
              <description>BLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKCNT</name>
              <description>BLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_CH5CTSR-->
        <register>
          <name>PDMA_CH5CTSR</name>
          <displayName>PDMA_CH5CTSR</displayName>
          <description>PDMA_CH5CTSR</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBLKLEN</name>
              <description>CBLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBLKCNT</name>
              <description>CBLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_ISR-->
        <register>
          <name>PDMA_ISR</name>
          <displayName>PDMA_ISR</displayName>
          <description>PDMA_ISR</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GEISTA0</name>
              <description>GEISTA0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA0</name>
              <description>BEISTA0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA0</name>
              <description>HTISTA0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA0</name>
              <description>TCISTA0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA0</name>
              <description>TEISTA0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEISTA1</name>
              <description>GEISTA1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA1</name>
              <description>BEISTA1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA1</name>
              <description>HTISTA1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA1</name>
              <description>TCISTA1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA1</name>
              <description>TEISTA1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEISTA2</name>
              <description>GEISTA2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA2</name>
              <description>BEISTA2</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA2</name>
              <description>HTISTA2</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA2</name>
              <description>TCISTA2</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA2</name>
              <description>TEISTA2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEISTA3</name>
              <description>GEISTA3</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA3</name>
              <description>BEISTA3</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA3</name>
              <description>HTISTA3</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA3</name>
              <description>TCISTA3</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA3</name>
              <description>TEISTA3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEISTA4</name>
              <description>GEISTA4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA4</name>
              <description>BEISTA4</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA4</name>
              <description>HTISTA4</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA4</name>
              <description>TCISTA4</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA4</name>
              <description>TEISTA4</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEISTA5</name>
              <description>GEISTA5</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEISTA5</name>
              <description>BEISTA5</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTISTA5</name>
              <description>HTISTA5</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCISTA5</name>
              <description>TCISTA5</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEISTA5</name>
              <description>TEISTA5</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PDMA_ISCR-->
        <register>
          <name>PDMA_ISCR</name>
          <displayName>PDMA_ISCR</displayName>
          <description>PDMA_ISCR</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GEICLR0</name>
              <description>GEICLR0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR0</name>
              <description>BEICLR0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR0</name>
              <description>HTICLR0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR0</name>
              <description>TCICLR0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR0</name>
              <description>TEICLR0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEICLR1</name>
              <description>GEICLR1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR1</name>
              <description>BEICLR1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR1</name>
              <description>HTICLR1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR1</name>
              <description>TCICLR1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR1</name>
              <description>TEICLR1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEICLR2</name>
              <description>GEICLR2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR2</name>
              <description>BEICLR2</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR2</name>
              <description>HTICLR2</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR2</name>
              <description>TCICLR2</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR2</name>
              <description>TEICLR2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEICLR3</name>
              <description>GEICLR3</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR3</name>
              <description>BEICLR3</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR3</name>
              <description>HTICLR3</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR3</name>
              <description>TCICLR3</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR3</name>
              <description>TEICLR3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEICLR4</name>
              <description>GEICLR4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR4</name>
              <description>BEICLR4</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR4</name>
              <description>HTICLR4</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR4</name>
              <description>TCICLR4</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR4</name>
              <description>TEICLR4</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GEICLR5</name>
              <description>GEICLR5</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BEICLR5</name>
              <description>BEICLR5</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HTICLR5</name>
              <description>HTICLR5</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCICLR5</name>
              <description>TCICLR5</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEICLR5</name>
              <description>TEICLR5</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
