cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
      </registers>
    </peripheral>
    <!--EBI-->
    <peripheral>
      <name>EBI</name>
      <version>1.1</version>
      <description>EBI</description>
      <groupName>EBI</groupName>
      <baseAddress>0x40098000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--EBI_CR-->
        <register>
          <name>EBI_CR</name>
          <displayName>EBI_CR</displayName>
          <description>EBI_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE0</name>
              <description>MODE0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>MODE1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>MODE2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>MODE3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKEN0</name>
              <description>BANKEN0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKEN1</name>
              <description>BANKEN1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKEN2</name>
              <description>BANKEN2</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BANKEN3</name>
              <description>BANKEN3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE0</name>
              <description>NOIDLE0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE1</name>
              <description>NOIDLE1</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE2</name>
              <description>NOIDLE2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOIDLE3</name>
              <description>NOIDLE3</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLET</name>
              <description>IDLET</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EBI_SR-->
        <register>
          <name>EBI_SR</name>
          <displayName>EBI_SR</displayName>
          <description>EBI_SR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EBIBUSY</name>
              <description>EBIBUSY</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EBISMRST</name>
              <description>EBISMRST</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EBI_ATR-->
        <register>
          <name>EBI_ATR</name>
          <displayName>EBI_ATR</displayName>
          <description>EBI_ATR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>ADDRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>ADDRHOLD</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EBI_RTR-->
        <register>
          <name>EBI_RTR</name>
          <displayName>EBI_RTR</displayName>
          <description>EBI_RTR</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>RDSETUP</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSTRB</name>
              <description>RDSTRB</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--EBI_WTR-->
        <register>
          <name>EBI_WTR</name>
          <displayName>EBI_WTR</displayName>
          <description>EBI_WTR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>WRSETUP</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRSTRB</name>
              <description>WRSTRB</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
