cmsis-svd/cmsis-svd/data/Holtek/HT32F52342_52.svd
        <!--EBI_PR-->
        <register>
          <name>EBI_PR</name>
          <displayName>EBI_PR</displayName>
          <description>EBI_PR</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSPOL</name>
              <description>CSPOL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OEPOL</name>
              <description>OEPOL</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WEPOL</name>
              <description>WEPOL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALEPOL</name>
              <description>ALEPOL</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--I2S-->
    <peripheral>
      <name>I2S</name>
      <version>1.1</version>
      <description>I2S</description>
      <groupName>I2S</groupName>
      <baseAddress>0x40026000</baseAddress>
      <size>32</size>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2S</name>
        <value>28</value>
      </interrupt>
      <registers>
        <!--I2S_CR-->
        <register>
          <name>I2S_CR</name>
          <displayName>I2S_CR</displayName>
          <description>I2S_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2SEN</name>
              <description>I2SEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>TXEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN</name>
              <description>RXEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSIZE</name>
              <description>SMPSIZE</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>FORMAT</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BITEXT</name>
              <description>BITEXT</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCLKEN</name>
              <description>MCLKEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT</name>
              <description>REPEAT</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL</name>
              <description>CHANNEL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMUTE</name>
              <description>TXMUTE</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TXDMAEN</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RXDMAEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDEN</name>
              <description>CLKDEN</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCEN</name>
              <description>RCEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCSEL</name>
              <description>RCSEL</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BCKINV</name>
              <description>BCKINV</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCKINV</name>
              <description>MCKINV</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--I2S_IER-->
        <register>
          <name>I2S_IER</name>
          <displayName>I2S_IER</displayName>
          <description>I2S_IER</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXFTLIEN</name>
              <description>TXFTLIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUDIEN</name>
              <description>TXUDIEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXOVIEN</name>
              <description>TXOVIEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTLIEN</name>
              <description>RXFTLIEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUDIEN</name>
              <description>RXUDIEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOVIEN</name>
              <description>RXOVIEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
